app/Http/Controllers/SiteController.php

select * from `sites` where `site_url` = 'indien' limit 1
select * from `photos`
---
    public function show($nom_site){
        $site = Site::where('site_url', '=', $nom_site)->first();
        if ($site === null){
            return abort(404);
        } else {
            echo "<h1>Bienvenue sur le site $nom_site </h1>";
            $photos = Photo::all();